Case_super_save/Case3/case9/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    Table;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (4.599 0.749 -0.001) (7.001 0.751 0.101);
        }
    }

    {
        name    Table;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet Table;
        }
    }
    /*
    {
        name    cyclicFacesFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.099 -0.006 0.004)(0.101 0.006 0.016);
        }
    }

    {
        name    cyclicFacesSlaveCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -10 -10)(0.1 10 10);
        }
    }

    {
        name    cyclicFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet cyclicFacesFaceSet;
            cellSet cyclicFacesSlaveCells;
        }
    }
    
    {
        name    baffleFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.099 -10 -10)(0.101 10 10);
        }
    }

    {
        name    baffleFaceSet;
        type    faceSet;
        action  delete;
        source  boxToFace;
        sourceInfo
        {
            box (0.099 -0.006 0.004)(0.101 0.006 0.016);
        }
    }

    {
        name    baffleFaces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet baffleFaceSet;
        }
    }
    */
);

// ************************************************************************* //
